examples/render_all_grammars/dot/tests_functional_test_scoping_metamodel_provider_utf-16-le_Components.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


39610840[ label="{Model|}"]

40053448[ label="{Package|+name:ID\l}"]

40583016[ label="{Interface|+name:ID\l}"]

39323064[ label="{Component|+name:ID\l}"]

40586904[ label="{*Slot|}"]

37560696[ label="{SlotIn|+name:ID\l}"]

40101944[ label="{SlotOut|+name:ID\l}"]

40088408[ label="{Instance|+name:ID\l}"]

40623976[ label="{Connection|}"]

40636104[ label="{FQN|FQN}"]

40651656[ label="{Comment|\\/\\/.*$}"]

40617944[ label="{ID|}"]

40625976[ label="{STRING|}"]

40631512[ label="{BOOL|}"]

40637048[ label="{INT|}"]

40642584[ label="{FLOAT|}"]

40648120[ label="{STRICTFLOAT|}"]

40653656[ label="{NUMBER|}"]

40659192[ label="{BASETYPE|}"]

40664728[ label="{*OBJECT|}"]



39610840 -> 40053448[arrowtail=diamond, dir=both, headlabel="packages 0..*"]
40053448 -> 39323064[arrowtail=diamond, dir=both, headlabel="components 1..*"]
40053448 -> 40088408[arrowtail=diamond, dir=both, headlabel="instances 1..*"]
40053448 -> 40623976[arrowtail=diamond, dir=both, headlabel="connections 1..*"]
40053448 -> 40053448[arrowtail=diamond, dir=both, headlabel="packages 1..*"]
40053448 -> 40583016[arrowtail=diamond, dir=both, headlabel="interfaces 1..*"]
39323064 -> 39323064[headlabel="extends 1..*"]
39323064 -> 40586904[arrowtail=diamond, dir=both, headlabel="slots 0..*"]
40586904 -> 37560696 [dir=back]
40586904 -> 40101944 [dir=back]
37560696 -> 40583016[headlabel="formats 1..*"]
40101944 -> 40583016[headlabel="formats 1..*"]
40088408 -> 39323064[headlabel="component "]
40623976 -> 40088408[headlabel="from_inst "]
40623976 -> 40101944[headlabel="from_port "]
40623976 -> 40088408[headlabel="to_inst "]
40623976 -> 37560696[headlabel="to_port "]
40653656 -> 40648120 [dir=back]
40653656 -> 40637048 [dir=back]
40659192 -> 40653656 [dir=back]
40659192 -> 40642584 [dir=back]
40659192 -> 40631512 [dir=back]
40659192 -> 40617944 [dir=back]
40659192 -> 40625976 [dir=back]
40664728 -> 40659192 [dir=back]

}
